particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */
#include "logging.h"
#include <memory>
#include "nrf_gpio.h"
#include "nrfx_spim.h"
#include "nrfx_spis.h"
#include "spi_hal.h"
#include "pinmap_hal.h"
#include "pinmap_impl.h"
#include "gpio_hal.h"
#include "interrupts_hal.h"
#include "concurrent_hal.h"
#include "delay_hal.h"
#include "check.h"
#include "scope_guard.h"

#define DEFAULT_SPI_MODE        SPI_MODE_MASTER
#define DEFAULT_DATA_MODE       SPI_MODE3
#define DEFAULT_BIT_ORDER       MSBFIRST
#define DEFAULT_SPI_CLOCK       SPI_CLOCK_DIV256

typedef struct nrf5x_spi_info_t {
    const nrfx_spim_t*                  master;
    const nrfx_spis_t*                  slave;
    app_irq_priority_t                  priority;
    uint8_t                             ss_pin;
    uint8_t                             sck_pin;
    uint8_t                             mosi_pin;
    uint8_t                             miso_pin;

    hal_spi_mode_t                      spi_mode;
    uint8_t                             data_mode;
    uint8_t                             bit_order;
    uint32_t                            clock;

    volatile uint8_t                    spi_ss_state;
    uint8_t*                            slave_tx_buf;
    uint8_t*                            slave_rx_buf;
    bool                                slave_tx_buf_free;
    const uint8_t*                      master_tx_data;
    uint32_t                            master_tx_data_length;
    uint32_t                            master_tx_data_index;
    uint8_t*                            master_tx_buf;
    uint32_t                            master_tx_buf_length;
    uint8_t*                            master_rx_buf;

    hal_spi_dma_user_callback           dma_user_callback;
    hal_spi_select_user_callback        select_user_callback;

    volatile hal_spi_state_t            state;
    volatile bool                       transmitting;
    volatile uint16_t                   transfer_length;

    os_mutex_recursive_t                mutex;
} nrf5x_spi_info_t;

static const nrfx_spim_t m_spim2 = NRFX_SPIM_INSTANCE(2);
static const nrfx_spim_t m_spim3 = NRFX_SPIM_INSTANCE(3);
static const nrfx_spis_t m_spis2 = NRFX_SPIS_INSTANCE(2);

static nrf5x_spi_info_t spiMap[HAL_PLATFORM_SPI_NUM] = {
    {&m_spim3, nullptr,  APP_IRQ_PRIORITY_HIGH, PIN_INVALID, SCK, MOSI, MISO}, // TODO: SPI3 doesn't support SPI slave mode
#if PLATFORM_ID == PLATFORM_TRACKER
    {&m_spim2, &m_spis2, APP_IRQ_PRIORITY_HIGH, PIN_INVALID, SCK1, MOSI1, MISO1},
#else
    {&m_spim2, &m_spis2, APP_IRQ_PRIORITY_HIGH, PIN_INVALID, D2, D3, D4},  // TODO: Change pin number
#endif
};

static uint8_t dummy_buf;

static uint32_t spiTransfer(hal_spi_interface_t spi, uint8_t *tx_buf, uint8_t *rx_buf, uint32_t size);

static bool spiMasterTransferChunk(hal_spi_interface_t spi) {
    if (!spiMap[spi].master_tx_data || !spiMap[spi].master_tx_buf) {
        return false;
    }
    if (spiMap[spi].master_tx_data_index >= spiMap[spi].master_tx_data_length) {
        return false;
    }
    spiMap[spi].transmitting = true; // Just in case
    uint32_t chunkSize = std::min(spiMap[spi].master_tx_data_length - spiMap[spi].master_tx_data_index, spiMap[spi].master_tx_buf_length);
    uint32_t index = spiMap[spi].master_tx_data_index;
    memcpy(spiMap[spi].master_tx_buf, &spiMap[spi].master_tx_data[index], chunkSize);
    uint8_t* rxPtr = spiMap[spi].master_rx_buf ? nullptr : &spiMap[spi].master_rx_buf[index];
    SPARK_ASSERT(spiTransfer(spi, spiMap[spi].master_tx_buf, rxPtr, chunkSize) == chunkSize);
    spiMap[spi].master_tx_data_index += chunkSize;
    return true;
}

static void spiMasterEventHandler(nrfx_spim_evt_t const * p_event, void * p_context) {
    if (p_event->type == NRFX_SPIM_EVENT_DONE) {
        // LOG_DEBUG(TRACE, ">> spi: rx: %d, tx: %d", p_event->xfer_desc.tx_length, p_event->xfer_desc.rx_length);
        int spi = (int)p_context;

        if (spiMasterTransferChunk((hal_spi_interface_t)spi)) {
            return;
        }
        if (spiMap[spi].master_tx_buf) {
            free(spiMap[spi].master_tx_buf);
        }
        spiMap[spi].master_tx_data = nullptr;
        spiMap[spi].master_tx_buf = nullptr;
        spiMap[spi].master_rx_buf = nullptr;
        spiMap[spi].master_tx_data_length = 0;
        spiMap[spi].master_tx_data_index = 0;
        spiMap[spi].master_tx_buf_length = 0;
        spiMap[spi].transmitting = false;
        if (spiMap[spi].dma_user_callback) {
            (*spiMap[spi].dma_user_callback)();
        }
    }
}

static void spiSlaveEventHandler(nrfx_spis_evt_t const * p_event, void * p_context) {
    int spi = (int) p_context;

    if (p_event->evt_type == NRFX_SPIS_XFER_DONE) {
        spiMap[spi].transfer_length = p_event->rx_amount;
        spiMap[spi].transmitting = false;

        if (spiMap[spi].slave_tx_buf_free && spiMap[spi].slave_tx_buf) {
            free(spiMap[spi].slave_tx_buf);
        }

        if (p_event->rx_amount) {
            if (spiMap[spi].dma_user_callback) {
                (*spiMap[spi].dma_user_callback)();
            }
        }
        // LOG_DEBUG(TRACE, ">> spi: rx: %d, tx: %d", p_event->rx_amount, p_event->tx_amount);

        // Reset spi slave data buffer
        SPARK_ASSERT(nrfx_spis_buffers_set(spiMap[spi].slave, (uint8_t *)&dummy_buf, sizeof(dummy_buf), (uint8_t *)&dummy_buf, sizeof(dummy_buf)) == NRF_SUCCESS);
    } else if (p_event->evt_type == NRFX_SPIS_BUFFERS_SET_DONE) {
        // LOG_DEBUG(TRACE, ">> NRFX_SPIS_BUFFERS_SET_DONE");
    }
}

static void spiOnSelectedHandler(void *data) {
    int spi = (int)data;
    uint8_t state = !HAL_GPIO_Read(spiMap[spi].ss_pin);
    spiMap[spi].spi_ss_state = state;
    if (spiMap[spi].select_user_callback) {
        spiMap[spi].select_user_callback(state);
    }
}

static inline nrf_spim_frequency_t getNrfSpiFrequency(hal_spi_interface_t spi, uint8_t clock_div) {
    switch (clock_div) {
        case SPI_CLOCK_DIV2:
            if (spi == HAL_SPI_INTERFACE1) {
                return NRF_SPIM_FREQ_32M;
            }
        case SPI_CLOCK_DIV4:
            if (spi == HAL_SPI_INTERFACE1) {
                return NRF_SPIM_FREQ_16M;
            }
        case SPI_CLOCK_DIV8:
            return NRF_SPIM_FREQ_8M;
        case SPI_CLOCK_DIV16:
            return NRF_SPIM_FREQ_4M;
        case SPI_CLOCK_DIV32:
            return NRF_SPIM_FREQ_2M;
        case SPI_CLOCK_DIV64:
            return NRF_SPIM_FREQ_1M;
        case SPI_CLOCK_DIV128:
            return NRF_SPIM_FREQ_500K;
        case SPI_CLOCK_DIV256:
            return NRF_SPIM_FREQ_250K;
    }

    return NRF_SPIM_FREQ_8M;
}

static inline uint8_t getNrfPinNum(uint8_t pin) {
    if (pin >= TOTAL_PINS) {
        return NRFX_SPIM_PIN_NOT_USED;
    }

    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    return NRF_GPIO_PIN_MAP(PIN_MAP[pin].gpio_port, PIN_MAP[pin].gpio_pin);
}

static void spiInit(hal_spi_interface_t spi, hal_spi_mode_t mode) {
    uint32_t err_code;

    if (mode == SPI_MODE_MASTER) {
        static const nrf_spim_mode_t nrf_spim_mode[4] = {NRF_SPIM_MODE_0, NRF_SPIM_MODE_1, NRF_SPIM_MODE_2, NRF_SPIM_MODE_3};
        nrfx_spim_config_t spim_config = NRFX_SPIM_DEFAULT_CONFIG;
        spim_config.sck_pin      = getNrfPinNum(spiMap[spi].sck_pin);
        spim_config.mosi_pin     = getNrfPinNum(spiMap[spi].mosi_pin);
        spim_config.miso_pin     = getNrfPinNum(spiMap[spi].miso_pin);
        spim_config.ss_pin       = NRFX_SPIM_PIN_NOT_USED;
        spim_config.irq_priority = spiMap[spi].priority;
        spim_config.orc          = 0xFF;
        spim_config.frequency    = getNrfSpiFrequency(spi, spiMap[spi].clock);
        spim_config.mode         = nrf_spim_mode[spiMap[spi].data_mode];
        spim_config.bit_order    = (spiMap[spi].bit_order == MSBFIRST) ? NRF_SPIM_BIT_ORDER_MSB_FIRST : NRF_SPIM_BIT_ORDER_LSB_FIRST;

        err_code = nrfx_spim_init(spiMap[spi].master, &spim_config, spiMasterEventHandler, (void *)((int)spi));
        SPARK_ASSERT(err_code == NRF_SUCCESS);

        if (HAL_Pin_Is_Valid(spiMap[spi].ss_pin)) {
            hal_gpio_config_t conf = {
                .size = sizeof(conf),
                .version = HAL_GPIO_VERSION,
                .mode = OUTPUT,
                .set_value = true,
                .value = 1,
                .drive_strength = HAL_GPIO_DRIVE_HIGH,
            };
            HAL_Pin_Configure(spiMap[spi].ss_pin, &conf, nullptr);
        }
    } else {
        static const nrf_spis_mode_t nrf_spis_mode[4] = {NRF_SPIS_MODE_0, NRF_SPIS_MODE_1, NRF_SPIS_MODE_2, NRF_SPIS_MODE_3};
        nrfx_spis_config_t spis_config;
        spis_config.sck_pin      = getNrfPinNum(spiMap[spi].sck_pin);
        spis_config.mosi_pin     = getNrfPinNum(spiMap[spi].mosi_pin);
        spis_config.miso_pin     = getNrfPinNum(spiMap[spi].miso_pin);
        spis_config.csn_pin      = getNrfPinNum(spiMap[spi].ss_pin);
        spis_config.csn_pullup   = NRF_GPIO_PIN_PULLUP;
        spis_config.miso_drive   = NRF_GPIO_PIN_S0S1;
        spis_config.irq_priority = spiMap[spi].priority;
        spis_config.orc          = 0xFF;
        spis_config.def          = 0xFF;
        spis_config.mode         = nrf_spis_mode[spiMap[spi].data_mode];
        spis_config.bit_order    = (spiMap[spi].bit_order == MSBFIRST) ? NRF_SPIS_BIT_ORDER_MSB_FIRST : NRF_SPIS_BIT_ORDER_LSB_FIRST;

        err_code = nrfx_spis_init(spiMap[spi].slave, &spis_config, spiSlaveEventHandler, (void *)((int) spi));
        SPARK_ASSERT(err_code == NRF_SUCCESS);

        HAL_Pin_Mode(spiMap[spi].ss_pin, INPUT_PULLUP);
        HAL_Interrupts_Attach(spiMap[spi].ss_pin, &spiOnSelectedHandler, (void*)(spi), CHANGE, nullptr);
    }

    // Set pin function
    HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_SPI);
    HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_SPI);
    HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_SPI);
}

static void spiUninit(hal_spi_interface_t spi) {
    if (spiMap[spi].spi_mode == SPI_MODE_MASTER) {
        nrfx_spim_uninit(spiMap[spi].master);
    } else {
        nrfx_spis_uninit(spiMap[spi].slave);
        HAL_Interrupts_Detach(spiMap[spi].ss_pin);
    }

    HAL_Pin_Mode(spiMap[spi].sck_pin, INPUT_PULLUP);
    HAL_Pin_Mode(spiMap[spi].mosi_pin, PIN_MODE_NONE);
    HAL_Pin_Mode(spiMap[spi].miso_pin, PIN_MODE_NONE);

    HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_NONE);
    HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_NONE);
    HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_NONE);
}

static uint32_t spiTransfer(hal_spi_interface_t spi, uint8_t *tx_buf, uint8_t *rx_buf, uint32_t size) {
    // LOG_DEBUG(TRACE, "spi send, size: %d", size);

    uint32_t err_code;
    spiMap[spi].transmitting = true;
    spiMap[spi].transfer_length = size;

    nrfx_spim_xfer_desc_t const spim_xfer_desc = {
        .p_tx_buffer = tx_buf,
        .tx_length   = tx_buf ? size : 0,
        .p_rx_buffer = rx_buf,
        .rx_length   = rx_buf ? size : 0,
    };
    err_code = nrfx_spim_xfer(spiMap[spi].master, &spim_xfer_desc, 0);

    if (err_code) {
        spiMap[spi].transmitting = false;
    }

    return err_code ? 0 : size;
}

static void spiTransferCancel(hal_spi_interface_t spi) {
    if (spiMap[spi].spi_mode == SPI_MODE_MASTER) {
        nrfx_spim_abort(spiMap[spi].master);
    } else {
        while (nrfx_spis_buffers_set(spiMap[spi].slave, nullptr, 0, nullptr, 0) == NRFX_ERROR_INVALID_STATE);
    }
}

void hal_spi_init(hal_spi_interface_t spi) {
    os_thread_scheduling(false, nullptr);
    if (spiMap[spi].mutex == nullptr) {
        os_mutex_recursive_create(&spiMap[spi].mutex);
    }
    os_thread_scheduling(true, nullptr);

    hal_spi_acquire(spi, nullptr);

    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
    }

    // Default: SPI_MODE_MASTER, SPI_MODE3, MSBFIRST, 16MHZ
    spiMap[spi].state = HAL_SPI_STATE_DISABLED;
    spiMap[spi].transmitting = false;
    spiMap[spi].spi_mode = DEFAULT_SPI_MODE;
    spiMap[spi].bit_order = DEFAULT_BIT_ORDER;
    spiMap[spi].data_mode = DEFAULT_DATA_MODE;
    spiMap[spi].clock = DEFAULT_SPI_CLOCK;
    spiMap[spi].spi_ss_state = 0;
    spiMap[spi].dma_user_callback = nullptr;
    spiMap[spi].select_user_callback = nullptr;
    spiMap[spi].transfer_length = 0;
    spiMap[spi].master_tx_data = nullptr;
    spiMap[spi].master_tx_buf = nullptr;
    spiMap[spi].master_rx_buf = nullptr;
    spiMap[spi].master_tx_data_length = 0;
    spiMap[spi].master_tx_data_index = 0;
    spiMap[spi].master_tx_buf_length = 0;
    spiMap[spi].slave_tx_buf_free = false;

    hal_spi_release(spi, nullptr);
}

void hal_spi_begin(hal_spi_interface_t spi, uint16_t pin) {
    // Default to Master mode
    hal_spi_begin_ext(spi, SPI_MODE_MASTER, pin, nullptr);
}

void hal_spi_begin_ext(hal_spi_interface_t spi, hal_spi_mode_t mode, uint16_t pin, void* reserved) {
    if (spi >= HAL_PLATFORM_SPI_NUM) {
        return;
    }

