particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
    return 0;
}

int hal_spi_sleep(hal_spi_interface_t spi, bool sleep, void* reserved) {
    if (sleep) {
        CHECK_TRUE(hal_spi_is_enabled(spi), SYSTEM_ERROR_INVALID_STATE);
        while (spiMap[spi].transmitting);
        spiUninit(spi);
        // spiUninit() clears pin function, retrieve it.
        HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_SPI);
        HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_SPI);
        HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_SPI);
        spiMap[spi].state = HAL_SPI_STATE_SUSPENDED;
    } else {
        CHECK_TRUE(spiMap[spi].state == HAL_SPI_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        hal_spi_begin_ext(spi, spiMap[spi].spi_mode, spiMap[spi].ss_pin, nullptr);
    }
    return SYSTEM_ERROR_NONE;
}

int32_t hal_spi_acquire(hal_spi_interface_t spi, const hal_spi_acquire_config_t* conf) {
    if (!HAL_IsISR()) {
        os_mutex_recursive_t mutex = spiMap[spi].mutex;
        if (mutex) {
            // FIXME: os_mutex_recursive_lock doesn't take any arguments, using trylock for now
            if (!conf || conf->timeout != 0) {
                return os_mutex_recursive_lock(mutex);
            } else {
                return os_mutex_recursive_trylock(mutex);
            }
        }
    }
    return -1;
}

int32_t hal_spi_release(hal_spi_interface_t spi, void* reserved) {
    if (!HAL_IsISR()) {
        os_mutex_recursive_t mutex = spiMap[spi].mutex;
        if (mutex) {
            return os_mutex_recursive_unlock(mutex);
        }
    }
    return -1;
}
